### 🌊 Neptune Apply Results

**Terraform Stacks:** `apps/web, apps/web/ci-102-1, apps/web/ci-102-2`

**Neptune completed the apply with status:** ✅
> For more details, see the [GitHub Actions run](https://github.com/devopsfactory-io/neptune-tests/actions/runs/23422457150)

**Command ✅** `terragrunt apply -auto-approve` (stack: apps/web)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web] 05:13:09.938 INFO   Downloading Terraform configurations from ../../_modules/null-stack into ./.terragrunt-cache/6P9tidISWBB3QzlNzQtu-E3IDNE/wXSEdkNd5e5MY27MFN0bjqcoO98
05:13:10.322 INFO   tofu: Initializing the backend...
05:13:10.796 INFO   tofu: 
05:13:10.796 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:13:10.796 INFO   tofu: use this backend unless the backend configuration changes.
05:13:11.024 INFO   tofu: Initializing provider plugins...
05:13:11.024 INFO   tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:13:11.210 INFO   tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:13:11.882 INFO   tofu: - Installing hashicorp/null v3.2.4...
05:13:12.315 INFO   tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:13:12.790 INFO   tofu: - Installing hashicorp/local v2.7.0...
05:13:13.368 INFO   tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:13:13.369 INFO   tofu: Providers are signed by their developers.
05:13:13.369 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
05:13:13.369 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
05:13:13.369 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:13:13.369 INFO   tofu: selections it made above. Include this file in your version control repository
05:13:13.369 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
05:13:13.369 INFO   tofu: you run "tofu init" in the future.
05:13:13.369 INFO   tofu: OpenTofu has been successfully initialized!
05:13:13.369 INFO   tofu: 
05:13:13.369 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:13:13.369 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:13:13.369 INFO   tofu: should now work.
05:13:13.369 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:13:13.369 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
05:13:13.369 INFO   tofu: commands will detect it and remind you to do so if necessary.

stdout:
[apps/web] 05:13:14.301 STDOUT tofu: local_file.output: Refreshing state... [id=02b8a7d21d6e858cd56b387b18a7f09886438742]
05:13:14.301 STDOUT tofu: null_resource.stack: Refreshing state... [id=5873597553842205034]
05:13:14.310 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:13:14.311 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:13:14.311 STDOUT tofu:   + create
05:13:14.311 STDOUT tofu: OpenTofu will perform the following actions:
05:13:14.311 STDOUT tofu:   # local_file.output will be created
05:13:14.311 STDOUT tofu:   + resource "local_file" "output" {
05:13:14.311 STDOUT tofu:       + content              = "apps/web deployed"
05:13:14.311 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:13:14.311 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:13:14.311 STDOUT tofu:       + content_md5          = (known after apply)
05:13:14.311 STDOUT tofu:       + content_sha1         = (known after apply)
05:13:14.311 STDOUT tofu:       + content_sha256       = (known after apply)
05:13:14.311 STDOUT tofu:       + content_sha512       = (known after apply)
05:13:14.311 STDOUT tofu:       + directory_permission = "0777"
05:13:14.311 STDOUT tofu:       + file_permission      = "0777"
05:13:14.311 STDOUT tofu:       + filename             = "./output.txt"
05:13:14.311 STDOUT tofu:       + id                   = (known after apply)
05:13:14.311 STDOUT tofu:     }
05:13:14.311 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:13:14.311 STDOUT tofu: 
05:13:14.353 STDOUT tofu: local_file.output: Creating...
05:13:14.355 STDOUT tofu: local_file.output: Creation complete after 0s [id=02b8a7d21d6e858cd56b387b18a7f09886438742]
05:13:14.356 STDOUT tofu: 
05:13:14.357 STDOUT tofu: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
05:13:14.357 STDOUT tofu: 
```

</details>

**Command ✅** `terragrunt apply -auto-approve` (stack: apps/web/ci-102-1)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-102-1] 05:13:14.675 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/LjDMVE2jnA-r4KEPw1_3gHdJxtE/wXSEdkNd5e5MY27MFN0bjqcoO98
05:13:15.050 INFO   tofu: Initializing the backend...
05:13:15.488 INFO   tofu: 
05:13:15.488 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:13:15.488 INFO   tofu: use this backend unless the backend configuration changes.
05:13:15.740 INFO   tofu: Initializing provider plugins...
05:13:15.740 INFO   tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:13:15.885 INFO   tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:13:16.313 INFO   tofu: - Installing hashicorp/null v3.2.4...
05:13:16.775 INFO   tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:13:17.123 INFO   tofu: - Installing hashicorp/local v2.7.0...
05:13:17.588 INFO   tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:13:17.588 INFO   tofu: Providers are signed by their developers.
05:13:17.588 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
05:13:17.588 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
05:13:17.588 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:13:17.588 INFO   tofu: selections it made above. Include this file in your version control repository
05:13:17.588 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
05:13:17.588 INFO   tofu: you run "tofu init" in the future.
05:13:17.588 INFO   tofu: OpenTofu has been successfully initialized!
05:13:17.588 INFO   tofu: 
05:13:17.588 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:13:17.588 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:13:17.589 INFO   tofu: should now work.
05:13:17.589 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:13:17.589 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
05:13:17.589 INFO   tofu: commands will detect it and remind you to do so if necessary.

stdout:
[apps/web/ci-102-1] 05:13:18.582 STDOUT tofu: null_resource.stack: Refreshing state... [id=513367671554999496]
05:13:18.582 STDOUT tofu: local_file.output: Refreshing state... [id=1f4f63dac9cb80d65f6be29552c2cb03b26900f6]
05:13:18.593 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:13:18.593 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:13:18.593 STDOUT tofu:   + create
05:13:18.593 STDOUT tofu: OpenTofu will perform the following actions:
05:13:18.593 STDOUT tofu:   # local_file.output will be created
05:13:18.594 STDOUT tofu:   + resource "local_file" "output" {
05:13:18.594 STDOUT tofu:       + content              = "apps/web/ci-102-1 deployed"
05:13:18.594 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:13:18.594 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:13:18.594 STDOUT tofu:       + content_md5          = (known after apply)
05:13:18.594 STDOUT tofu:       + content_sha1         = (known after apply)
05:13:18.594 STDOUT tofu:       + content_sha256       = (known after apply)
05:13:18.594 STDOUT tofu:       + content_sha512       = (known after apply)
05:13:18.594 STDOUT tofu:       + directory_permission = "0777"
05:13:18.594 STDOUT tofu:       + file_permission      = "0777"
05:13:18.594 STDOUT tofu:       + filename             = "./output.txt"
05:13:18.594 STDOUT tofu:       + id                   = (known after apply)
05:13:18.594 STDOUT tofu:     }
05:13:18.594 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:13:18.595 STDOUT tofu: 
05:13:18.634 STDOUT tofu: local_file.output: Creating...
05:13:18.636 STDOUT tofu: local_file.output: Creation complete after 0s [id=1f4f63dac9cb80d65f6be29552c2cb03b26900f6]
05:13:18.638 STDOUT tofu: 
05:13:18.638 STDOUT tofu: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
05:13:18.638 STDOUT tofu: 
```

</details>

**Command ✅** `terragrunt apply -auto-approve` (stack: apps/web/ci-102-2)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-102-2] 05:13:18.958 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/Yc3gcfg0bxbyefOz0IsZf6F6epE/wXSEdkNd5e5MY27MFN0bjqcoO98
05:13:19.290 INFO   tofu: Initializing the backend...
05:13:19.692 INFO   tofu: 
05:13:19.692 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:13:19.692 INFO   tofu: use this backend unless the backend configuration changes.
05:13:19.883 INFO   tofu: Initializing provider plugins...
05:13:19.884 INFO   tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:13:20.017 INFO   tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:13:20.404 INFO   tofu: - Installing hashicorp/local v2.7.0...
05:13:20.857 INFO   tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:13:21.203 INFO   tofu: - Installing hashicorp/null v3.2.4...
05:13:21.663 INFO   tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:13:21.664 INFO   tofu: Providers are signed by their developers.
05:13:21.664 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
05:13:21.664 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
05:13:21.664 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:13:21.664 INFO   tofu: selections it made above. Include this file in your version control repository
05:13:21.664 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
05:13:21.664 INFO   tofu: you run "tofu init" in the future.
05:13:21.665 INFO   tofu: OpenTofu has been successfully initialized!
05:13:21.665 INFO   tofu: 
05:13:21.665 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:13:21.665 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:13:21.665 INFO   tofu: should now work.
05:13:21.665 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:13:21.665 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
05:13:21.665 INFO   tofu: commands will detect it and remind you to do so if necessary.

stdout:
[apps/web/ci-102-2] 05:13:22.553 STDOUT tofu: null_resource.stack: Refreshing state... [id=2217601692384182174]
05:13:22.553 STDOUT tofu: local_file.output: Refreshing state... [id=bfc4796fd7ff08067e32d6c4b5782340cd83abe5]
05:13:22.563 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:13:22.563 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:13:22.563 STDOUT tofu:   + create
05:13:22.563 STDOUT tofu: OpenTofu will perform the following actions:
05:13:22.563 STDOUT tofu:   # local_file.output will be created
05:13:22.563 STDOUT tofu:   + resource "local_file" "output" {
05:13:22.563 STDOUT tofu:       + content              = "apps/web/ci-102-2 deployed"
05:13:22.564 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:13:22.564 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:13:22.564 STDOUT tofu:       + content_md5          = (known after apply)
05:13:22.564 STDOUT tofu:       + content_sha1         = (known after apply)
05:13:22.564 STDOUT tofu:       + content_sha256       = (known after apply)
05:13:22.564 STDOUT tofu:       + content_sha512       = (known after apply)
05:13:22.564 STDOUT tofu:       + directory_permission = "0777"
05:13:22.564 STDOUT tofu:       + file_permission      = "0777"
05:13:22.564 STDOUT tofu:       + filename             = "./output.txt"
05:13:22.564 STDOUT tofu:       + id                   = (known after apply)
05:13:22.564 STDOUT tofu:     }
05:13:22.564 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:13:22.564 STDOUT tofu: 
05:13:22.605 STDOUT tofu: local_file.output: Creating...
05:13:22.607 STDOUT tofu: local_file.output: Creation complete after 0s [id=bfc4796fd7ff08067e32d6c4b5782340cd83abe5]
05:13:22.609 STDOUT tofu: 
05:13:22.609 STDOUT tofu: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
05:13:22.609 STDOUT tofu: 
```

</details>



Automatically merging because all changed stacks have been successfully applied.
